-- 管理员信息表
INSERT INTO `admin_info` VALUES 
(1, 'admin', '123456', '男', '29', '18888888888', 1),
(15, 'admin2', '123456', '男', '23', '18877778888', 1),
(16, 'admin3', '123456', '女', '23', '18877778888', 1),
(17, 'admin4', '123456', '女', '23', '18877778888', 1),
(22, 'admin5', '123456', '女', '23', '18877778888', 1),
(23, 'admin6', '123456', '女', '23', '18877778888', 1),
(24, 'admin7', '123456', '女', '23', '18877778888', 1),
(25, 'admin8', '123456', '女', '23', '18877778888', 1);

-- 学院信息表
INSERT INTO `xueyuan_info` VALUES 
(1, '信息工程学院', '巴拉巴拉巴拉', 20),
(2, '计算机学院', '巴拉巴拉巴拉', 25),
(3, '软件学院', '巴拉巴拉巴拉', 30),
(4, '外国语学院', '巴拉巴拉巴拉', 25),
(7, '文学院', '巴拉巴拉巴拉', 30);

-- 专业信息表
INSERT INTO `zhuanye_info` VALUES 
(8, '电子信息工程', '电子系', 1),
(9, '软件工程', '软件系', 3),
(12, '古汉语信息', '文学系', 7);

-- 教师信息表
INSERT INTO `teacher_info` VALUES 
(26, '张老师', '123456', '女', '35', '教授', 2, 8),
(27, '赵老师', '123456', '男', '29', '教授', 2, 8),
(28, '王老师', '123456', '女', '28', '副教授', 2, 9),
(31, '李老师', '123456', '女', '28', '副教授', 2, 9),
(32, '夏老张', '123456', '女', '28', '副教授', 2, 12),
(33, '倪老师', '123456', '女', '28', '副教授', 2, 9);

-- 学生信息表
INSERT INTO `student_info` VALUES 
(27, '张三', '123456', '男', '24', '20000', 3, 1, 3),
(28, '李四', '123456', '男', '23', '20001', 3, 2, 2),
(29, '王五', '123456', '男', '23', '20002', 3, 3, 2),
(30, '赵六', '123456', '男', '23', '20003', 3, 4, 3),
(31, '李七', '123456', '女', '24', '20005', 3, 7, 2);

-- 课程信息表
INSERT INTO `class_info` VALUES 
(13, 'Java基础', '学会Java基础', 8, 3, 26, 20, '周一第一大节', '3A101', 2),
(14, 'Python基础', '学会Python基础', 8, 3, 27, 20, '周二第一大节', '3A102', 2);

-- 选课信息表
INSERT INTO `xuanke_info` VALUES 
(23, 'Java基础', '学会Java基础', 8, 3, 26, 20, '周一第一大节', '3A101', 28, '已开课'),
(24, 'Python基础', '学会Python基础', 8, 3, 27, 20, '周二第一大节', '3A102', 28, '待开课'),
(29, 'Java基础', '学会Java基础', 8, 3, 26, 20, '周一第一大节', '3A101', 27, '已开课'),
(32, 'Python基础', '学会Python基础', 8, 3, 27, 20, '周二第一大节', '3A102', 27, '待开课');